import styles from "./index.less"

const SignUpProtocol = (props) => {
  const { setShowSignUpProtocol } = props

  return (
    <div className={styles.signUpProtocol}>
      <div className={styles.signUpProtocolTitle}>听说帮</div>
      <div className={styles.signUpProtocolContent}>
        <div className={styles.text}>
          <h3 style={{ textAlign: "center" }}>听说帮注册协议</h3>
          <p>
            听说帮依靠网络技术，向您提供数字化学习服务。请您在注册和使用听说帮前仔细阅读本协议。如您不同意本协议任何条款，请勿注册账号或使用本平台。
          </p>
          <h4>一、注册协议条款的确认和接受</h4>
          <p>
            听说帮(以下亦称“本产品”)同意按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动网的相关服务(以下称“网络服务”)。
          </p>
          <p>
            为获得网络服务,申请人应当认真阅读、充分理解本《协议》中各条款,包括免除或者限制听说帮责任的免责条款及对用户的权利限制条款。审慎阅读并选择接受或不接受本《协议》(未成年人应在法定监护人陪同下阅读)。
          </p>
          <p>
            同意接受本协议的全部条款的,申请人应当按照页面上的提示完成全部的注册程序,否则视为不接受本《协议》全部条款,申请人应当终止并退出申请。
          </p>
          <p>
            本《协议》可由听说帮随时更新,更新后的协议条款一旦公布即代替原来的协议条款,恕不再另行通知,用户可在本产品查阅最新版协议条款。在本产品修改《协议》条款后,如果用户不接受修改后的条款,请立即停止使用本产品提供的网络服务,继续使用的用户将被视为已接受了修改后的协议。
          </p>
          <h4>二、服务内容</h4>
          <p>
            1、网络服务的具体内容由听说帮根据实际情况提供,例如英语听力训练、口语训练等相关测评服务。
          </p>
          <p>
            2、用户理解,本产品仅提供相关的网络服务,除此之外与相关网络服务有关的设备(如个人电脑、手机及其他与接入互联网或移动网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费等)均应由用户自行负担。
          </p>
          <h4>三、用户账号</h4>
          <p>1、经本产品通过身份认证的用户即为正式用户。</p>
          <p>2、如发现用户账号中含有不雅文字或不恰当名称的,本产品保留注销其用户账号的权利。</p>
          <p>3、用户账号的所有权归本产品,用户完成申请注册手续后,用户享有使用权。</p>
          <p>
            4、用户有义务保证密码和账号的安全,用户利用该账号所进行的一切活动引起的任何损失或损害,由用户自行承担全部责任,本产品不承担任何责任。如用户发现账号遭到未授权的使用或发生其他任何安全问题,应立即修改账号密码并妥善保管。因黑客行为或用户的保管疏忽导致账号非法使用,本产品不承担任何责任。
          </p>
          <p>
            5、用户账号独占使用权仅属于初始申请注册人。为避免因账号问题产生纠纷,用户不应私下有偿、无偿转让或合用账号,用户应当自行承担因违反此要求而遭致的任何损失。
          </p>
          <p>
            6、用户账号在丢失、遗忘密码,须遵照本产品的忘记密码途径请求找回账号。本产品的账户恢复机制仅负责识别申请用户所提资料与系统记录资料是否一致,而无法识别申诉人是否系账号的真正使用权人。对用户因被他人冒名申请而致的任何损失,本产品不承担任何责任,用户知晓账号及密码保管责任在于用户,本产品并不承诺账号丢失或遗忘密码后用户一定能找回账号。用户应当谨慎填写初始注册手机号码作为确认接收争议账号的指定手机号码。
          </p>
          <h4>四、使用规则</h4>
          <p>
            1、用户在使用本产品网络服务过程中,必须遵循国家的相关法律法规,不得发布危害国家安全、色情、暴力等非法内容;也不得利用本产品平台发布含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、或其它道德上令人反感的内容。
          </p>
          <p>
            2、本产品可依其合理判断,对违反有关法律法规或本协议约定;或侵犯、妨害、威胁任何人权利或安全的内容,或者假冒他人的行为,本产品有权停止传输任何前述内容,并有权依其自行判断对违反本条款的任何用户采取适当的法律行动,包括但不限于,删除具有违法性、侵权性、不当性等内容,阻止其使用本产品全部或部分网络服务,并且依据法律法规保存有关信息并向有关部门报告等。
          </p>
          <p>
            3、对于经由本产品网络服务而传送的内容,本产品不保证前述内容的正确性、完整性或品质。用户在接受本服务时,有可能会接触到令人不快、不适当或令人厌恶的内容。在任何情况下,本产品均不对任何内容负责,包括但不限于任何内容发生任何错误或纰漏以及衍生的任何损失或损害。本产品有权(但无义务)自行拒绝或删除经由本产品网络服务提供的任何内容。用户使用上述内容,应自行承担风险。
          </p>
          <p>
            4、对于用户通过本产品网络服务上传到本产品上可公开获取区域的任何内容,用户同意听说帮在全世界范围内具有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可,以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容(整体或部分),和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。
          </p>
          <p>
            5、用户通过本产品网络服务所发布的任何内容并不反映本产品的观点或政策,本产品对此不承担任何责任。用户须对上述内容的真实性、合法性、无害性、有效性等全权负责,与用户所发布信息相关的任何法律责任由用户自行承担,与本产品无关。
          </p>
          <h4>五、版权声明</h4>
          <p>
            本产品提供的网络服务中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商标和/或其它财产所有权法律的保护,未经相关权利人同意,上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行,或者被用于其他任何商业目的。所有以上资料或资料的任何部分仅可作为私人和非商业用途保存。本产品不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害赔偿，以任何形式，向用户或任何第三方负责。
          </p>
        </div>
        <div
          className={styles.button}
          onClick={() => {
            setShowSignUpProtocol(false)
          }}
        >
          返回
        </div>
      </div>
      <div className={styles.info}>
        <div>Copyright 2009-2019 版权所有 明博公司 京ICP备09067472号-20</div>
        <div>京公网安备11010802013475号</div>
      </div>
    </div>
  )
}

export default SignUpProtocol
